УТ_для_edt/src/Catalogs/БизнесРегионы/БизнесРегионы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>БизнесРегионы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <attributes>
    <name>ОсновнойМенеджер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеГеографическогоРегиона</name>
    <type>
      <types>String</types>
      <types>Number</types>
      <numberQualifiers>
        <precision>25</precision>
      </numberQualifiers>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГеографическийРегион</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СезоннаяГруппа</name>
    <type>
      <types>CatalogRef.СезонныеГруппыБизнесРегионов</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КодГорода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КодКЛАДР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КодСтраны</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_Платежеспособность</name>
    <type>
      <types>EnumRef.CRM_Платежеспособность</types>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ЧисленностьНаселения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КодПоКлассификатору</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_КодОКАТО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>CRM_ВремяПоГринвичу_GMT</name>
    <comment>Время региона относительно времени по Гринвичу (например, Москва: +4)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СмартКодСубъектаРФ</name>
    <comment>#1537 смарт: Корбутов запрет добавления бизнес-регионов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СмартИдентификаторФНС</name>
    <comment>#1537 смарт: Мосолов 26.12.2023 //Запрет создания элементов справочника Бизнес-регионы</comment>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОтветственоеПодразделение</name>
    <comment>//++ #1739 смарт: Фролов 04.04.2024 //Создание рабочего места секретаря для распределения звонков и обращений.</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОбслуживающееПодразделениеСЦ</name>
    <comment>#Б-2296 смарт: Лопато 12.02.2025 //Справочник &quot;Бизнес-регионы&quot;. Добавить реквизит &quot;Обслуживающее подразделение СЦ&quot;</comment>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>смартОфисКомпании</name>
    <comment>//++ #Б-2306 смарт: Фролов 18.03.2025 //Доработать механизм распределения Лидов для Татарстана и Башкирии</comment>
    <type>
      <types>CatalogRef.CRM_ОфисыКомпании</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt/src/Enums/CRM_Платежеспособность/CRM_Платежеспособность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>CRM_Платежеспособность</name>
  <enumValues>
    <name>Низкая</name>
  </enumValues>
  <enumValues>
    <name>Средняя</name>
  </enumValues>
  <enumValues>
    <name>Высокая</name>
  </enumValues>
</mdclass:Enum>

УТ_для_edt/src/Catalogs/БизнесРегионы/Forms/CRM_Модуль_ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;

	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(Объект, ЭтотОбъект);
	
	// Обработчик механизма "Свойства"
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Объект", Объект);
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтаФорма, ДополнительныеПараметры);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
// +CRM Модуль
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Объект.CRM_КодСтраны = "7";
		Объект.CRM_Платежеспособность = Перечисления.CRM_Платежеспособность.Средняя;
	КонецЕсли;
// -CRM Модуль
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
// +CRM Модуль
	СформироватьПредставление();
// -CRM Модуль
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

	МодификацияКонфигурацииПереопределяемый.ПриЧтенииНаСервере(ЭтаФорма, ТекущийОбъект);

	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтаФорма, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Обработчик механизма "Свойства"
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтаФорма, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Обработчик механизма "Свойства"
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтаФорма, ТекущийОбъект);

	МодификацияКонфигурацииПереопределяемый.ПередЗаписьюНаСервере(ЭтаФорма, Отказ, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

&НаКлиенте
Процедура  ПослеЗаписи(ПараметрыЗаписи)

	МодификацияКонфигурацииКлиентПереопределяемый.ПослеЗаписи(ЭтаФорма, ПараметрыЗаписи);

КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	МодификацияКонфигурацииПереопределяемый.ПослеЗаписиНаСервере(ЭтаФорма, ТекущийОбъект, ПараметрыЗаписи);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ГеографическийРегионНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ЗначениеГеографическогоРегиона", Объект.ЗначениеГеографическогоРегиона);
	
	Если Не ГеографическаяСхемаДляОтчетовЗаполнена() Тогда
		ТекстПредупреждения = НСтр("ru = 'Не выбрана карта в разделе администрирования ""CRM и продажи"". Географический регион не может быть выбран.'");
		ПоказатьПредупреждение(Неопределено, ТекстПредупреждения);
	Иначе
		ОткрытьФорму("Справочник.БизнесРегионы.Форма.ФормаВыбораГеографическогоРегиона", ПараметрыФормы, Элемент);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ГеографическийРегионОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Модифицированность = Истина;
	Объект.ГеографическийРегион = ВыбранноеЗначение.НазваниеГеографическогоРегиона;
	Объект.ЗначениеГеографическогоРегиона = ВыбранноеЗначение.ЗначениеГеографическогоРегиона;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

// Конец СтандартныеПодсистемы.Свойства

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт // АПК:78 - исключить из проверки.
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#Область Прочее

&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтаФорма);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ГеографическаяСхемаДляОтчетовЗаполнена()
	
	Возврат ЗначениеЗаполнено(Константы.ГеографическаяСхемаДляОтчетов.Получить().Получить());
	
КонецФункции

#КонецОбласти

#КонецОбласти

// +CRM Модуль

// Процедура формирует представление.
//
// Параметры:
//	Нет.
//
&НаКлиенте
Процедура СформироватьПредставление()
	Элементы.Представление.Заголовок = "+" + Объект.CRM_КодСтраны + " (" + Объект.CRM_КодГорода + ")";	
КонецПроцедуры	// СформироватьПредставление()

// Процедура-обработчик события "ПриИзменении" поля ввода "CRM_КодСтраны".
//
&НаКлиенте
Процедура CRM_КодСтраныПриИзменении(Элемент)
	Если ПустаяСтрока(Объект.CRM_КодСтраны) Тогда Возврат; КонецЕсли;
	СформироватьПредставление();
КонецПроцедуры // CRM_КодСтраныПриИзменении()

// Процедура-обработчик события "ПриИзменении" поля ввода "CRM_КодГорода".
//
&НаКлиенте
Процедура CRM_КодГородаПриИзменении(Элемент)
	СформироватьПредставление();
КонецПроцедуры // CRM_КодГородаПриИзменении()



// -CRM Модуль
